Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.atlantis.random_id.webhook[0]: Refreshing state... [id=ZJmiNOE0dvFnfJf7sSvuFNcYhj7OB1z-3IcL8y45SK0xMA8BIoMnUQjPUuE9jUDEJyixrcSYJhCzAWWczi_SQg]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-03071834fcf78009c]
module.atlantis.module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-west-2:096194284558:certificate/680b03d5-9a26-417b-96c6-d5c2affba725]
module.atlantis.aws_cloudwatch_log_group.atlantis: Refreshing state... [id=atlantis]
module.atlantis.module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-west-2:096194284558:cluster/atlantis]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c8bd08a12d8e8e3a]
module.atlantis.aws_ssm_parameter.webhook[0]: Refreshing state... [id=/atlantis/webhook/secret]
module.atlantis.aws_iam_role.ecs_task_execution: Refreshing state... [id=atlantis-ecs_task_execution]
module.atlantis.aws_ssm_parameter.atlantis_github_user_token[0]: Refreshing state... [id=/atlantis/github/user/token]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-07fa7038a6a994df8]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b321587da7287630]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0088306426ec08b68]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d12515e0d036e9aa]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-05d6bd53ab1786377]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-01d2972de60fdc773]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0d5366a5057df7a46]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00391e7720f284252]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c42be98ac44c6b02]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d12515e0d036e9aa1080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a05d29d1be06d951]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c221995116380feb]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05976b0b85d971142]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-04d0c4f210ce991a4]
module.atlantis.aws_iam_role_policy_attachment.ecs_task_execution[1]: Refreshing state... [id=atlantis-ecs_task_execution-20210225234020155200000001]
module.atlantis.aws_iam_role_policy_attachment.ecs_task_execution[0]: Refreshing state... [id=atlantis-ecs_task_execution-20210225230236759900000005]
module.atlantis.aws_iam_role_policy.ecs_task_access_secrets[0]: Refreshing state... [id=atlantis-ecs_task_execution:ECSTaskAccessSecretsPolicy]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a0b8794042fa70ac]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0c4bff6b202aa384f]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-003938429d88f404e]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c42be98ac44c6b021080289494]
module.atlantis.module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z0655367KVAUAGUDFWBE__6f27b10b8a40d6c8a2d9afaa6e53b62b.atlantis.missionsa.net._CNAME]
module.atlantis.module.acm.aws_route53_record.validation[1]: Refreshing state... [id=Z0655367KVAUAGUDFWBE__6f27b10b8a40d6c8a2d9afaa6e53b62b.atlantis.missionsa.net._CNAME]
module.atlantis.module.atlantis_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-01be888c00c781858]
module.atlantis.module.alb_https_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0dcab4a4a6f680da8]
module.atlantis.module.alb_http_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0aae3faa43f3e83d6]
module.atlantis.module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2021-02-25 23:01:41 +0000 UTC]
module.atlantis.module.atlantis_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-240600715]
module.atlantis.module.alb_https_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-872994518]
module.atlantis.module.atlantis_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-2400611669]
module.atlantis.module.alb_http_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-445900778]
module.atlantis.module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:096194284558:loadbalancer/app/atlantis/ec25e63fcff7039d]
module.atlantis.module.alb_https_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2980390864]
module.atlantis.module.alb_https_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3134209703]
module.atlantis.module.alb_http_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3091100736]
module.atlantis.module.alb_http_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1855280978]
module.atlantis.module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:096194284558:targetgroup/atlantis/8895cce468ffeb60]
module.atlantis.aws_route53_record.atlantis[0]: Refreshing state... [id=Z0655367KVAUAGUDFWBE_atlantis_A]
module.atlantis.module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:096194284558:listener/app/atlantis/ec25e63fcff7039d/270c18ecc0272e40]
module.atlantis.module.alb.aws_lb_listener.frontend_https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:096194284558:listener/app/atlantis/ec25e63fcff7039d/9315bfafb6ff70b2]
module.atlantis.aws_lb_listener_rule.unauthenticated_access_for_cidr_blocks[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:096194284558:listener-rule/app/atlantis/ec25e63fcff7039d/9315bfafb6ff70b2/448988eb464379c6]
module.atlantis.aws_ecs_task_definition.atlantis: Refreshing state... [id=atlantis]
module.atlantis.aws_ecs_service.atlantis: Refreshing state... [id=arn:aws:ecs:us-west-2:096194284558:service/atlantis/atlantis]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.b will be created
+ resource "aws_s3_bucket" "b" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "lance-atlantis-pr-test-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.missionsa.net/lock?id=lalanza808%252Fterraform-live-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
